/*
Бондарчук Владимир
1 курс ,группа 8, лаб 2

B2. Вычислить значение ряда:S при заданном m, если  х изменяется от a до b с шагом h. Результаты получить в виде таблицы.

Используем функцию нахождения синуса по Ряду Тейлора с точностью до 0.0001.

тест:
введите m>5:10
введите a и b:1 8
введите шаг h :1
-------------------------------------------------------------------
|  Значение X  |  Значение  C |  Значение <cmath> |  Значение asm |
-------------------------------------------------------------------
|           1  |  -0.0108871  |       -0.0108871  |   -0.0108871  |
|           2  |     69952.7  |          69952.7  |      69952.7  |
|           3  |-4.39808e+08  |     -4.39808e+08  | -4.39808e+08  |
|           4  | 1.42274e+11  |      1.42274e+11  |  1.42274e+11  |
|           5  |-5.07094e+12  |     -5.07095e+12  | -5.07094e+12  |
|           6  |-3.37127e+14  |     -3.37126e+14  | -3.37127e+14  |
|           7  | 2.06765e+16  |      2.06765e+16  |  2.06765e+16  |
|           8  |-4.34478e+17  |     -4.34478e+17  | -4.34478e+17  |
-------------------------------------------------------------------
время работы алгоритма = 24 мс
*/
#include"Header.h"
void main()
{
	
	setlocale(LC_ALL, "rus");
	float a, b, h;
	long double s = 0, s1 = 0, s2 = 0;
	int m;
	ofstream file1("result.txt");
	cout << "введите m>5:"; cin >> m;
	cout << "введите a и b:"; cin >> a >> b;
	cout << "введите шаг h :"; cin >> h;
	cout << "-------------------------------------------------------------------------------" << endl;
	cout << "|  Значение X  |  Значение  C |  Значение <cmath> |  Значение asm сопроцессор |" << endl;
	cout << "-------------------------------------------------------------------------------" << endl;
	file1 << "-------------------------------------------------------------------------------" << endl;
	file1 << "|  Значение X  |  Значение  C |  Значение <cmath> |  Значение asm сопроцессор |" << endl;
	file1 << "-------------------------------------------------------------------------------" << endl;
	int start = clock();
	while (a <= b)
	{
		s = 0; s1 = 0; s2 = 0;
		for (int i = 5; i <= m; i++)
		{
			s = s + (POW(a, 2 * i + 1)) / (2 * i + 1)*SIN(i*a);
			s1 = s1 + (pow(a, 2 * i + 1)) / (2 * i + 1)*sin(i*a);
			s2 = s2 + (APOW(a, 2 * i + 1)) / (2 * i + 1)*ASIN(i*a);
		}
		cout << "|" << setw(12) << a << "  |" << setw(12) << s << "  |" << setw(17) << s1 << "  |"<<setw(25)<<s2<<"  |" << endl;
		file1 << "|" << setw(12) << a << "  |" << setw(12) << s << "  |" << setw(17) << s1 << "  |"<<setw(25) << s2 << "  |" << endl;

		a += h;
	}
	int end = clock();
	cout << "-------------------------------------------------------------------------------" << endl;
	cout << "время работы алгоритма = " << end - start << " мс" << endl;
	file1 << "-------------------------------------------------------------------------------" << endl;
	file1 << "время работы алгоритма = " << end - start << " мс" << endl;
	file1.close();
	system("pause");
}




