/*

********************************************
**            Алексей Афанасенко          **
**             1 курс 8 группа            **
**            Учебна практика 1           **
********************************************
--------------------------------------------
Задание:

Дана функция  у= -2*arcsin(х)+3* Ch(х)+1,5.
Найти наибольшее значение функции,
если  х изменяется от a до b с шагом h.
Результат получить в виде таблицы.
--------------------------------------------
Пояснение к решению:

X должно быть в промежутке [-1..1]

Разложение ch в ряд Тейлора(Функция myCh)
ch(x)=1+x^2/2! + x^4/4! + x^2n/2n!
Вычисление i-ого члена разложения в ряд Тейлора через предыдущей член
pi= p_{i-1} *x*x/(2*i)/(2*i-1)

Разложение arcsin в ряд Тейлора(myAsin)
arcsin(x)=x+x^3/6+3*x^5/40+..+((2n)!*x^(2n+1))/(4^n  * (n!)^2 * (2n+1))
Вычисление i-ого члена разложения в ряд Тейлора через предыдущей член
p = p_{i-1} / (2 * i) / (2 * i - 1) * x * x; (за исключением множетеля 1/(2n+1) считается отдельно)

Т.к. каждый последующий член разложения медленно убывает при X близком к 1 и -1, то на данных значениях теряется точность

--------------------------------------------
Формат входных данных:
Во входном файле input.txt должно содержаться три числа a,b,h |a|<=1, |b|<=1
--------------------------------------------
Формат выходных данных:
В выходном файле output.txt содержится таблица значений функции а также наибольшее значение функции от a до b с шагом h
--------------------------------------------
Примеры:

№1
Входные данные(input.txt):
-1 1 0.25
Выходные данные(output.txt):
|           x           |  y with my function  |  y with math function  |
|                     -1|               9.19123|                 9.27083|
|                  -0.75|               7.08001|                 7.08017|
|                   -0.5|               5.93005|                 5.93008|
|                  -0.25|               5.09959|                  5.0996|
|                      0|                   4.5|                     4.5|
|                   0.25|               4.08888|                 4.08888|
|                    0.5|               3.83571|                 3.83568|
|                   0.75|               3.68809|                 3.68793|
|                      1|               3.06725|                 2.98765|
The function takes the maximum value when the argument is x=-1. The maximum value of the function is equal to 9.19123
Programm finnished in 8ms

№2
Входные данные(input.txt):
1 0.23 0.01
Выходные данные(output.txt):
|           x           |  y with my function  |  y with math function  |
|                   0.23|               4.11555|                 4.11555|
|                   0.24|               4.10209|                 4.10208|
|                   0.25|               4.08888|                 4.08888|
|                   0.26|               4.07594|                 4.07593|
|                   0.27|               4.06323|                 4.06323|
|                   0.28|               4.05078|                 4.05078|
|                   0.29|               4.03858|                 4.03858|
|                    0.3|               4.02663|                 4.02663|
|                   0.31|               4.01492|                 4.01492|
|                   0.32|               4.00346|                 4.00346|
|                   0.33|               3.99223|                 3.99223|
|                   0.34|               3.98125|                 3.98124|
|                   0.35|                3.9705|                 3.97049|
|                   0.36|               3.95998|                 3.95997|
|                   0.37|               3.94969|                 3.94969|
|                   0.38|               3.93964|                 3.93963|
|                   0.39|               3.92981|                 3.92979|
|                    0.4|                3.9202|                 3.92018|
|                   0.41|               3.91082|                 3.91079|
|                   0.42|               3.90163|                 3.90162|
|                   0.43|               3.89267|                 3.89266|
|                   0.44|               3.88392|                 3.88392|
|                   0.45|               3.87539|                 3.87538|
|                   0.46|               3.86706|                 3.86705|
|                   0.47|               3.85893|                 3.85891|
|                   0.48|               3.85099|                 3.85098|
|                   0.49|               3.84326|                 3.84323|
|                    0.5|               3.83571|                 3.83568|
|                   0.51|               3.82834|                 3.82831|
|                   0.52|               3.82116|                 3.82112|
|                   0.53|               3.81412|                  3.8141|
|                   0.54|               3.80727|                 3.80726|
|                   0.55|               3.80059|                 3.80058|
|                   0.56|               3.79407|                 3.79405|
|                   0.57|               3.78771|                 3.78768|
|                   0.58|               3.78149|                 3.78145|
|                   0.59|               3.77541|                 3.77536|
|                    0.6|               3.76946|                 3.76939|
|                   0.61|               3.76363|                 3.76355|
|                   0.62|               3.75785|                 3.75782|
|                   0.63|               3.75224|                  3.7522|
|                   0.64|               3.74671|                 3.74666|
|                   0.65|               3.74128|                 3.74121|
|                   0.66|               3.73591|                 3.73583|
|                   0.67|               3.73061|                  3.7305|
|                   0.68|               3.72527|                 3.72522|
|                   0.69|               3.72003|                 3.71996|
|                    0.7|                3.7148|                 3.71471|
|                   0.71|               3.70958|                 3.70946|
|                   0.72|               3.70424|                 3.70417|
|                   0.73|               3.69893|                 3.69884|
|                   0.74|               3.69356|                 3.69343|
|                   0.75|               3.68809|                 3.68793|
|                   0.76|               3.68239|                 3.68229|
|                   0.77|               3.67663|                 3.67649|
|                   0.78|               3.67068|                 3.67049|
|                   0.79|               3.66439|                 3.66424|
|                    0.8|               3.65792|                 3.65771|
|                   0.81|               3.65101|                 3.65084|
|                   0.82|                3.6438|                 3.64358|
|                   0.83|               3.63604|                 3.63584|
|                   0.84|               3.62784|                 3.62755|
|                   0.85|               3.61889|                 3.61862|
|                   0.86|               3.60935|                 3.60894|
|                   0.87|                3.5988|                 3.59839|
|                   0.88|               3.58724|                  3.5868|
|                   0.89|               3.57448|                 3.57399|
|                    0.9|               3.56031|                 3.55972|
|                   0.91|               3.54428|                  3.5437|
|                   0.92|               3.52618|                 3.52555|
|                   0.93|               3.50552|                 3.50477|
|                   0.94|               3.48165|                 3.48065|
|                   0.95|                3.4533|                  3.4522|
|                   0.96|               3.41939|                 3.41788|
|                   0.97|               3.37704|                 3.37508|
|                   0.98|               3.32164|                 3.31873|
|                   0.99|               3.24117|                  3.2357|
|                      1|               3.06725|                 2.98765|
The function takes the maximum value when the argument is x=0.23. The maximum value of the function is equal to 4.11555
Programm finnished in 20ms




*/
#include <cmath>
#include <ctime>
#include <iomanip>
#include <iostream>
#include <fstream>
#include "func.h"

using namespace std;



int main()
{
	unsigned int startTime = clock();

	double a, b, h;

	openFiles();//открытие файлов
	input(a, b, h);//чтение данных
	calcAndOutput(a, b, h);//подсчет и вывод
	outputTime(startTime);//вывод времени работы

	
	return 0;

}