/*
Петров Константин
8 группа

Задано  выражение (инфиксная форма, например (5+45)*(55-5))  содержащее числа (любого типа),
знаки операций, круглые скобки. Записать его в виде обратной польской записи (постфиксная форма)
и вычислить его значение.


Тесты

(4+3)^2    4 3 + 2 ^    49

*/

#define _CRT_SECURE_NO_WARNINGS

#include <iostream>
#include <fstream>
#include <iomanip>
#include <cstdlib>
#include <locale>
#include <cmath>
#include <stack>
#include "Header.h"
using namespace std;

int main() {
	setlocale(LC_ALL, "ru");
	//--------------------------------------------------------------------------------------------	
	char *str = new char[81];
	ifstream in;
	in.open("Input.txt");
	in >> str;
	//--------------------------------------------------------------------------------------------
	char *str_opn = new char[strlen(str)];
	str_opn[0] = '\0';
	//--------------------------------------------------------------------------------------------
	if (st_to_str_opn(str, str_opn))
		cout << str_opn << endl;
	else
		return 0;
	//--------------------------------------------------------------------------------------------
	double value = value_of_opn(str_opn);
	cout << endl << "Значение выражения равно - " << setprecision(6) << value << endl;
	//--------------------------------------------------------------------------------------------
	return 0;
}
