/*лабораторная работа №2
Для проверки результатов использовать   Math
Результаты получить в виде таблицы и записать в текстовый файл.
Для вычисления значения функций использовать разложение в ряд Тейлора.

задача №12
условие:	12.	Вычислить значения функции У=10*sin(x)/(1+log10(x*x)) ,  
если  х изменяется от a до b с шагом h.
Результаты получить в виде таблицы.

Алгоритм: высчитываем значение функции по Тейлору с точностью 0.000000001
и сравниваем полученное значение со значением функции, подсчитанной с помощью библиотеки 
<math.h>


Выполнил:студент 1-ого курса
группы №7 Мазанов Кирилл

Тесты:
y = 10*sin(x)/(1+log10(x*x))
----------------------------------------------
|  Значение X  |  Значение Y  |  Значение YT |
----------------------------------------------
|           1  |     8.41471  |     8.41471  |
|           2  |      5.6758  |     5.67596  |
|           3  |    0.722121  |    0.722121  |
|           4  |    -3.43358  |    -3.43358  |
|           5  |    -3.99895  |    -3.99895  |
|           6  |    -1.09305  |    -1.09305  |
|           7  |     2.44215  |     2.44215  |
|           8  |     3.52564  |     3.52564  |
|           9  |     1.41695  |     1.41695  |
|          10  |     -1.8134  |     -1.8134  |
----------------------------------------------

время работы алгоритма= 110 мс
*/

#include<stdio.h>
#include<math.h>
#include<iostream>
#include <fstream>
#include<iomanip>
#include <time.h>
using namespace std;

#define PI       3.14159265358979323846

long double fact(int n)
{
	long double f = 1;
	for (int i = 2; i <= n; i++)
		f /= i;
	return f;
}

double SinTeilor(double x, double eps)
{	
	while(x > PI * 2)
	{
		x -= PI * 2;
	}
	
	while(x < -PI * 2)
	{
		x += PI * 2;
	}

	long double c, sint;
	sint = c = x;
	int n = 1;
	while (fabs(c) > eps)
	{
		c = pow((double)-1, n)*pow(x, 2*n+1)*fact(2*n+1);

		sint += c;
		n++;
	}
	return (double)sint;
}

double LnTeilor(double x, int n)
{
	//-ln(1/x) == ln(x)
	int znak = 1;
	if(x > 2.0)
	{
		x = 1/x;
		znak = -1;
	}
	double lnt = 0;
	for(int i = 1; i <= n; i++)
		lnt += (pow((double)-1, i+1)*pow(x-1, i))/i;
	return lnt*znak;
}

void main()
{
	setlocale(LC_ALL, ".1251");//подключение русских символов
	double a, b, h;//описываем переменные

	cout << "Введите начальное значение" << endl;
	cin >> a;//Вводим значение переменной a

	cout << "Введите конечное значение" << endl;
	cin >> b;//Вводим значение переменной b

	do
	{
		cout << "Введите значение шага (h)" << endl;
		cin >> h;//Вводим значение шага H
		if(h <= 0)
			cout<<endl<<endl<<endl<<"Ошибка ввода! Шаг (h) не равен нулю и только положительный" << endl;
	} while(h <= 0);

	ofstream ofs("Лаб_2_В_12.txt");
	

	//составление шапки таблицы
	cout<<"y = 10*sin(x)/(1+log10(x*x))"<<endl;
	cout<<"----------------------------------------------"<<endl;
	cout<<"|  Значение X  |  Значение Y  |  Значение YT |"<<endl;	
	cout<<"----------------------------------------------"<<endl;
	ofs<<"y = 10*sin(x)/(1+log10(x*x))"<<endl;
	ofs<<"----------------------------------------------"<<endl;
	ofs<<"|  Значение X  |  Значение Y  |  Значение YT |"<<endl;	
	ofs<<"----------------------------------------------"<<endl;
	int start=clock();
	//цикл прохождения Х от A до B с шагом H
	for (double sum = 0, x = a; x <= b; x += h )
	{  
		double y = 10*sin(x)/(1+log10(x*x));

		double yt = 10*SinTeilor(x, 0.000000001)/(1+2*LnTeilor(fabs(x), 10000)/LnTeilor(10, 10000));

		//вывод значений Х и суммы в таблице
		cout << "|" << setw(12) << x << "  |" << setw(12) << y << "  |" << setw(12) << yt << "  |" << endl;
		ofs << "|" << setw(12) << x << "  |" << setw(12) << y << "  |" << setw(12) << yt << "  |" << endl;
	}
	int end=clock();
	cout << "----------------------------------------------" << endl << endl;
	ofs << "----------------------------------------------" << endl << endl;
	cout << "время работы алгоритма = " << end-start << " мс" << endl;
	ofs << "время работы алгоритма = " << end-start << " мс" << endl;

	ofs.close();

	system("pause");
}

