{Пельменева Елена.Лабораторная работа 3.
ЗадачаB9.
Условие.Заданы две целочисленные неубывающие последовательности
A=(ai), i=1..n, n<=100 и B=(bi), i=1..n, n<=100,т.е. есть одинаковые
элементы. Объединить эти массивы так, чтобы результирующий массив
стал строго  возрастающим.
Решение.Сравниваем элементы двух массивов между собой, выбираем меньший элемент,
затем сравниваем его с элементами уже записанными в искомый массив и если они
не равны, то записываем.

Тесты
   1.

vvedite size
5 8


pervuy massiv
36 212 349 391 449
vtoroy massiv
35 105 258 435 484 503 509 674
iskomuy massiv
35 36 105 212 258 349 391 435 449 484 503 509 674



   2.
vvedite size
15 20


pervuy massiv
132 183 258 308 457 501 645 776 932 996 1059 1198 1296 1343 1482
vtoroy massiv
94 146 339 521 598 696 743 758 956 1119 1192 1206 1369 1404 1441 1546 1623 1786
1950 2013
iskomuy massiv
94 132 146 183 258 308 339 457 501 521 598 645 696 743 758 776 932 956 996 1059
1119 1192 1198 1206 1296 1343 1369 1404 1441 1482 1546 1623 1786 1950 2013



   3.

vvedite size
2 3


pervuy massiv
27 170
vtoroy massiv
69 81 120
iskomuy massiv
27 69 81 120 170


   4.

vvedite size
30 60


pervuy massiv
82 272 419 484 488 667 847 999 1157 1324 1519 1623 1806 1957 2070 2212 2374 2375
 2449 2564 2632 2743 2857 2897 3015 3061 3218 3223 3239 3400
vtoroy massiv
114 294 366 415 520 613 685 800 912 1109 1303 1318 1486 1680 1826 1992 2094 2151
 2273 2444 2481 2576 2619 2675 2834 2937 3123 3180 3246 3307 3474 3649 3742 3850
 3934 4053 4107 4256 4334 4493 4554 4699 4724 4741 4931 5056 5172 5177 5320 5388
 5522 5572 5736 5745 5832 5934 6016 6021 6135 6221
iskomuy massiv
82 114 272 294 366 415 419 484 488 520 613 667 685 800 847 912 999 1109 1157 130
3 1318 1324 1486 1519 1623 1680 1806 1826 1957 1992 2070 2094 2151 2212 2273 237
4 2375 2444 2449 2481 2564 2576 2619 2632 2675 2743 2834 2857 2897 2937 3015 306
1 3123 3180 3218 3223 3239 3246 3307 3400 3474 3649 3742 3850 3934 4053 4107 425
6 4334 4493 4554 4699 4724 4741 4931 5056 5172 5177 5320 5388 5522 5572 5736 574
5 5832 5934 6016 6021 6135 6221


  5.
vvedite size
6 7


pervuy massiv
25 25 55 213 365 550
vtoroy massiv
60 174 180 272 346 466 559
iskomuy massiv
25 55 60 174 180 213 272 346 365 466 550 559}

program B9;

{$APPTYPE CONSOLE}

uses
  SysUtils;

type
tarray= array [1..100] of integer;
parray= array [1..200] of integer;
var
A,B:tarray;
C:parray;
i,j,n ,m,h, k:integer;

begin
 writeln('vvedite size');            {вводим массивы, являющиеся
                                     неубывающей последовательностью}
 read(n,m);
 randomize;
 A[1]:=random(200);
 for i:=2 to n do
 A[i]:=a[i-1]+random(200);
 writeln;
 B[1]:=random(200);
 for j:=2 to m do
 B[j]:=b[j-1] +random(200);
 writeln;

 writeln('pervuy massiv');            {выводим первый массив}
 for i:=1 to n do
 write(a[i], ' ');
 writeln;

 writeln('vtoroy massiv');         {выводим второй массив}
 for j:=1 to m do
 write(b[j], ' ');
 writeln;
 k:=2;
 i:=1;
 j:=1;
 while (i<=n) or (j<=m) do          {пока элементы не выходят за рамки
                                     массива выполням}
  begin
   if (i<=n)
    then
     Begin
     if (A[i]<=B[j])                {сравниваем элементы двух массивов между
                                     собой, если элемент первого массив меньше
                                     элемента второго массива, то выполняем.. }

      then
       begin
        if (C[k-1]<>A[i])            {сравниваем больший элемент с  элементом
                                         уже записанным в искомый массив}
         then
          Begin
           C[k]:=A[i];                {если они не равны, то записываем в искомый
                                        массив}
           k:=k+1;
          End;
        i:=i+1;                       {переходим к следующему элементу}
       end;
     end
    else
       begin
        if (C[k-1]<>B[j]) and (j<=m)  {сравниваем  элемент второго массива
                                       c элементом уже записанным в искомый
                                        массив }
         then
          Begin
           C[k]:=B[j];
           k:=k+1;
          End;
        j:=j+1;
       end;
   if (j<=m)
    then
     Begin
     if (B[j]<=A[i])                 {если элемент второго массива меньше
                                      элемента первого массива, то выполняем..}
      then
       begin
        if (C[k-1]<>B[j])             {сравниваем с предыдущим элементом
                                       искомого массива}
         then
          Begin
           C[k]:=B[j];
           k:=k+1;
          End;
        j:=j+1;
       end;
      end
      else
       begin
        if (C[k-1]<>A[i]) and (i<=n)
         then
          Begin
           C[k]:=A[i];
           k:=k+1;
          End;
        i:=i+1;
       end
  end;
 h:=k-1;                               {количество элементов искомого массива}
 writeln('iskomuy massiv');
 for k:=2 to h do                      {выводим искомый массив}
 write(C[k], ' ');
 writeln;
 readln;
 readln;
end.
