/*	
	Петров Константин
		8 группа

B10         Найти квадратный корень из А , используя рекуррентное соотношение:
		Xi=Xi-1/2 + A/(2*Xi-1 ), где Х0 =А,  с точностью  0.0001.
		Если  А изменяется от d до b с шагом h.  Результаты получить в виде таблицы.

	double msqrt(double a){
	double x0 = a, zn = 1;
	double e = 0.0001;
	if (a == 0) return 0;
	while (fabs(a / (zn*zn) - 1) > e) {                 
		zn = (x0 + a / x0) / 2;
		x0 = zn;
	}
	return 0;
}
*/

#include "Header.h"

int main(){
	double d = 0, b = 0, h = 0, a = 0;
	Input(d, b, h);

	ofstream out("Output.txt");
	cout << "***********************************************************" << endl;
	cout << "**   Число      **    АсмФункция    **     Разложение    **" << endl;
	cout << "***********************************************************" << endl;
	for (; d <= b; d += h){
		cout << "**    " << left << setw(6) << d << "    **    " << left << setw(10) << AsmF(d) << "    **     " <<left << setw(10) << MySqrt(d) << "    **" << endl;
	}
	cout << "***********************************************************" << endl;
	cout << "***********************************************************" << endl;
	cout << endl << endl << endl;

	out.close();
	system("pause");
	return 0;
}